import pandas as pd

data = {
    "Жанр": ["Класика", "Фантастика/фентезі", "Трилер", "Антиутопія", "Нон-фікшн", "Детектив"],
    "Хіба ревуть воли, як ясла повні?": [10, 1, 7, 2, 4, 2],
    "Сон літньої ночі": [10, 9, 1, 1, 3, 1],
    "Вбивство у «Східному експресі»": [8, 2, 4, 3, 5, 10],
    "Голодні ігри": [6, 8, 7, 10, 4, 3],
    "Мистецький злодій": [3, 1, 5, 1, 10, 5]
}

df = pd.DataFrame(data)
df = df.set_index("Жанр")

max_of_min = df.min().idxmax()
print("Оптимальна книга за методом максиміну: ", max_of_min)